README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Emacs org-mode demo</a></li>
<li><a href="#orgheadline2">2. What was generated</a></li>
</ul>
</div>
</div>

# Emacs org-mode demo<a id="orgheadline1"></a>

This is one of the resons I love Emacs. The power of it as an editor is outstanding. It provides a complete development environment for me. With it, I'm able to keep my source code and my documentation in the same file. I can extract the source code and generate the documentation using executable code blocks. If I need to insert links or images into my documentation I can. 

# What was generated<a id="orgheadline2"></a>

The only files that I created were the org files. The markdown file, html file and python file were all created by Emacs.